class KeyboardLayout:
    def __init__(self):
        self.english_letters = \
            [["`", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", "Backspace"],
             ["Tab", "q", "w", "e", "r", "t", "y", "u", "i", "o", "p", "[", "]", "\\"],
             ["Caps", "a", "s", "d", "f", "g", "h", "j", "k", "l", ";", "'", "Enter"],
             ["Shift", "z", "x", "c", "v", "b", "n", "m", ",", ".", "/"],
             ["Ctrl", "Alt", " "]]

        self.capital_english_letters = \
            [["`", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", "Backspace"],
             ["Tab", "Q", "W", "E", "R", "T", "Y", "U", "I", "O", "P", "[", "]", "\\"],
             ["Caps", "A", "S", "D", "F", "G", "H", "J", "K", "L", ";", "'", "Enter"],
             ["Shift", "Z", "X", "C", "V", "B", "N", "M", ",", ".", "/"],
             ["Ctrl", "Alt", " "]]

        self.russian_letters = \
            [["ё", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", "Backspace"],
             ["Tab", "й", "ц", "у", "к", "е", "н", "г", "ш", "щ", "з", "х", "ъ", "\\"],
             ["Caps", "ф", "ы", "в", "а", "п", "р", "о", "л", "д", "ж", "э", "Enter"],
             ["Shift", "я", "ч", "с", "м", "и", "т", "ь", "б", "ю", "."],
             ["Ctrl", "Alt", " "]]

        self.capital_russian_letters = \
            [["Ё", "1", "2", "3", "4", "5", "6", "7", "8", "9", "0", "-", "=", "Backspace"],
             ["Tab", "Й", "Ц", "У", "К", "Е", "Н", "Г", "Ш", "Щ", "З", "Х", "Ъ", "\\"],
             ["Caps", "Ф", "Ы", "В", "А", "П", "Р", "О", "Л", "Д", "Ж", "Э", "Enter"],
             ["Shift", "Я", "Ч", "С", "М", "И", "Т", "Ь", "Б", "Ю", "/"],
             ["Ctrl", "Alt", " "]]
